RhinoInside.Revit API Documentation
GeometryDecoder Class
 Converts a Revit geometry type to an equivalent Rhino geometry type.
Inheritance Hierarchy
System.Object
 RhinoInside.Revit.Convert.Geometry.GeometryDecoder
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8026
Syntax
public static class GeometryDecoder
class GeometryDecoder
The GeometryDecoder type exposes the following members.
Methods
Name | Description
ToBoundingBox(BoundingBoxXYZ)
 Converts the specified Autodesk.Revit.DB.BoundingBoxXYZ to an equivalent Rhino.Geometry.BoundingBox.
ToBoundingBox(Outline)
 Converts the specified Autodesk.Revit.DB.Outline to an equivalent Rhino.Geometry.BoundingBox.
ToBoundingBox(BoundingBoxXYZ, Transform)
 Converts the specified Autodesk.Revit.DB.BoundingBoxXYZ to an equivalent Rhino.Geometry.BoundingBox and outputs the conversion transform.
ToBox
 Converts the specified Autodesk.Revit.DB.BoundingBoxXYZ to an equivalent Rhino.Geometry.Box.
ToBrep(Face)
 Converts the specified Autodesk.Revit.DB.Face to an equivalent Rhino.Geometry.Brep.
ToBrep(Solid)
 Converts the specified Autodesk.Revit.DB.Solid to an equivalent Rhino.Geometry.Brep.
ToCurve(Arc)
 Converts the specified Autodesk.Revit.DB.Arc to an equivalent Rhino.Geometry.Curve.
ToCurve(Curve)
 Converts the specified Autodesk.Revit.DB.Curve to an equivalent Rhino.Geometry.Curve.
ToCurve(CurveLoop)
 Converts the specified Autodesk.Revit.DB.CurveLoop to an equivalent Rhino.Geometry.Curve.
ToCurve(CylindricalHelix)
 Converts the specified Autodesk.Revit.DB.CylindricalHelix to an equivalent Rhino.Geometry.Curve.
ToCurve(Ellipse)
 Converts the specified Autodesk.Revit.DB.Ellipse to an equivalent Rhino.Geometry.Curve.
ToCurve(HermiteSpline)
 Converts the specified Autodesk.Revit.DB.HermiteSpline to an equivalent Rhino.Geometry.Curve.
ToCurve(Line)
 Converts the specified Autodesk.Revit.DB.Line to an equivalent Rhino.Geometry.Curve.
ToCurve(NurbSpline)
 Converts the specified Autodesk.Revit.DB.NurbSpline to an equivalent Rhino.Geometry.Curve.
ToCurves
 Converts the specified Autodesk.Revit.DB.CurveArray to an equivalent array of Rhino.Geometry.Curve.
ToMesh
 Converts the specified Autodesk.Revit.DB.Mesh to an equivalent Rhino.Geometry.Mesh.
ToPlane
 Converts the specified Autodesk.Revit.DB.Plane to an equivalent Rhino.Geometry.Plane.
ToPoint
 Converts the specified Autodesk.Revit.DB.Point to an equivalent Rhino.Geometry.Point.
ToPoint2d
 Converts the specified Autodesk.Revit.DB.UV to an equivalent Rhino.Geometry.Point2d.
ToPoint3d
 Converts the specified Autodesk.Revit.DB.XYZ to an equivalent Rhino.Geometry.Point3d.
ToPolyCurves
 Converts the specified Autodesk.Revit.DB.CurveArrArray to an equivalent array of Rhino.Geometry.PolyCurve.
ToPolylineCurve
 Converts the specified Autodesk.Revit.DB.PolyLine to an equivalent Rhino.Geometry.PolylineCurve.
ToTransform
 Converts the specified Autodesk.Revit.DB.Transform to an equivalent Rhino.Geometry.Transform.
ToVector2d
 Converts the specified Autodesk.Revit.DB.UV to an equivalent Rhino.Geometry.Vector2d.
ToVector3d
 Converts the specified Autodesk.Revit.DB.XYZ to an equivalent Rhino.Geometry.Vector3d.
Top
See Also
Reference
RhinoInside.Revit.Convert.Geometry Namespace